app/controllers/movies_controller.rb

  def index
    #debugger
    #logger.info("Session start:" + session.inspect)
    # redirect if needed
    if (!params.key?(:sort) && session.key?(:sort)) || (!params.key?(:ratings) && session.key?(:ratings))
      #logger.info("Hiiiiiiiiiiiiiiiiiiii!!!!!!!!!!")
      flash.keep
      redirect_to :action => 'index', :sort => params.key?(:sort) ? params[:sort] : session[:sort], :ratings => params.key?(:ratings) ? params[:ratings] : session[:ratings]
    end

    # update session
    session[:sort] = params.key?(:sort) ? params[:sort] : session[:sort]
    session[:ratings] = params.key?(:ratings) ? params[:ratings] : session[:ratings]

    if session[:ratings].nil?
      rat = Movie.ratings
      session[:ratings] = {}
      rat.each { |s| session[:ratings][s] = 1 }
---
SELECT "movies".* FROM "movies" WHERE (rating = "G" or rating = "PG-13" or rating = "R") ORDER BY release_date